package ru.job4j;

public class Lesson172634 {
    byte age = 44; // возраст (подразумевается возраст человека)
    char sex = 'M'; // пол (обозначать будем символами - мужской сокращаем до М, женский до Ж)
    float height = 1.83F; // рост (измерять будем в метрах)
    short numberOfBricks = 30000; // количество кирпичей для постройки дома (небольшой одноэтажный дом площадью 100м2)
    long numberOfBacteria = 3300000000000L; // количество бактерий (измерять будем в КОЕ / г
    double distance = 99999999.788; //  расстояние до космических объектов (измерять будем в км)
    boolean workPermit = true; // разрешение на работу (рассматриваем всего 2 значения - или есть разрешение или его нет)
    int fileSize = 33000000; // размер файла (измерять будем в байтах)


}
