package ru.job4j;

public class Lesson172634 {
    byte age; // возраст (подразумевается возраст человека)
    char sex; // пол (обозначать будем символами - мужской сокращаем до М, женский до Ж)
    float height; // рост (измерять будем в метрах)
    short numberOfBricks; // количество кирпичей для постройки дома (небольшой одноэтажный дом площадью 100м2)
    double numberOfBacteria; // количество бактерий (измерять будем в КОЕ / г
    double distance; //  расстояние до космических объектов (измерять будем в км)
    boolean workPermit; // разрешение на работу (рассматриваем всего 2 значения - или есть разрешение или его нет)
    long fileSize; // размер файла (измерять будем в байтах)


}
