package ru.job4j;

public class Lesson172634 {

    /**
     * возраст (подразумевается возраст человека)
     */
    byte age  = 44;

     /**
      * пол (обозначать будем символами - мужской сокращаем до М, женский до Ж)
      */
    char sex = 'M';

    /**
     * рост (измерять будем в метрах)
     */
    float height = 1.83F;

    /**
     * количество кирпичей для постройки дома (небольшой одноэтажный дом площадью 100м2)
     */
    short numberOfBricks = 30000;

    /**
     * количество бактерий (измерять будем в КОЕ / г
     */
    double numberOfBacteria = 1.2345E+21;

    /**
     * расстояние до космических объектов (измерять будем в км)
     */
    double distance = 99999999.788;

    /**
     * разрешение на работу (рассматриваем всего 2 значения - или есть разрешение или его нет)
     */
    boolean workPermit  = true;

    /**
     * размер файла (измерять будем в байтах)
     * 1 ГБ = 1073741824 байт
     */
    long fileSize = 1073741824;


}
