package ru.job4j;

public class Lesson172634 {

    /**
     * возраст (подразумевается возраст человека)
     */
    byte age;

     /**
      * пол (обозначать будем символами - мужской сокращаем до М, женский до Ж)
      */
    char sex;

    /**
     * рост (измерять будем в метрах)
     */
    float height;

    /**
     * количество кирпичей для постройки дома (небольшой одноэтажный дом площадью 100м2)
     */
    short numberOfBricks;

    /**
     * количество бактерий (измерять будем в КОЕ / г
     */
    double numberOfBacteria;

    /**
     * расстояние до космических объектов (измерять будем в км)
     */
    double distance;

    /**
     * разрешение на работу (рассматриваем всего 2 значения - или есть разрешение или его нет)
     */
    boolean workPermit;

    /**
     * размер файла (измерять будем в байтах)
     */
    long fileSize;


}
